{"type":"PR","pr":{"number":382,"head":"3702e67cbe2d677fec0d2ea8e01bc943df5a53be"},"user":"Sonna Kim","status":"draft","branch":"cms/1-general-principles","collection":"foundation","commitMessage":"Update \"1-general-principles\" page","title":"General principles","description":"These are the strategic underpinnings for the CFPB’s design and development standards. They should serve as the backbone for the user experience, ensuring that the standards we set enable products that are easy to use and understand for consumers.\n### Public service, public trust\n#### Honest, transparent design that wins the public’s trust.\nWe establish trust through clear, concise, and approachable design that is always consumer-driven. We demonstrate transparency through our user-friendly online experiences and tools and our dedication to open-source content.\n### Give the user control\n#### Design to empower users with information.\nThe CFPB motivates consumers to take the control of their financial decision-making; our designs enable this process. Good design increases transparency and succinctly hands the user all the necessary information, giving consumers control of how they use it. Designers must rely on introspection and research to discover what path users instinctively take and then cater to those instincts.\n### Aesthetic integrity\n#### Align appearance with purpose.\nAesthetic integrity is not merely “attractiveness;” it implies the successful integration of design and function. Appearance should align with purpose. Using clear and intuitive design creates a trustworthy tone and a powerful platform for supporting the CFPB’s mission.\n#### Maintain consistency and clarity.\nMaintaining consistency in design empowers users to seamlessly transfer their knowledge and skills from one product to another. Focusing on consistency helps uphold aesthetic integrity.\n### Design with data\n#### Design gives voice to data, and data informs design.\nBecause the CFPB is a data-driven organization, quantitative measures of success should be integral to the design process. Design should incorporate data to aid understanding of complex issues, and data-driven feedback should influence the design process. Succinct and compelling visualization of information gives data a voice and helps us clarify otherwise indigestible numbers.\n### Inclusion and accessibility\n#### Design for the widest possible demographic with bias toward clear articulation, plain language, and intuitive design.\nWe design to meet each consumer where he or she is. We are sensitive to experiential level, timing, and biases and aim to design experiences that are equally accessible to everyone, and equally empowering no matter what the user’s skill set or familiarity. Simple, clean designs are the most effective and wide-reaching.\n### Coherent end-to-end user experience\n#### Unify parts of the user experience and transition seamlessly between them.\nThe best design guides the user’s experience from beginning-to-end and caters to his or her expectations. Navigation between sections should be intuitive and transitions should be seamless. Consistent quality and attention to detail are essential to maintain a cohesive user experience.","objects":{"entry":{"path":"docs/foundation/1-general-principles.md","sha":"86399187bc9d1467ebc4fbf820564c00626f5816"},"files":[]},"timeStamp":"2019-12-10T22:50:14.166Z"}