{"type":"PR","pr":{"number":325,"head":"4da0e92d8fca17fd7b357d03c5321defb4a9c6e0"},"user":"Rachael Keeler","status":"draft","branch":"cms/1-how-to-use-the-design-system","collection":"getting-started","commitMessage":"Update \"1-how-to-use-the-design-system\" page","title":"Updating this documentation","description":"## Creating new pages\n\n1. Through the Design System site you can quickly add a new page. Navigate to the section of the site where you’d like to add a new page. For example, if you want to add a new component page, make sure you’re in the “Components” section. \n2. Click the “+ Add new page” button at the bottom of the page.\n3. If you haven’t already, log in to our CFPB GitHub repo.\n4. Fill out the relevant fields of the CMS that appear on the left, a preview of your page will appear on the right. You can edit the fields on the left as needed. The rich text field will let you easily style the text, but you can use additional markdown as needed to create the page content you want.\n5. Click “Save” at the top of the screen to save your work. Netlify will create a pull request in our public GitHub repo: <https://github.com/cfpb/design-system/pulls>. \n6. Your work will not be visible until your pull request has been approved and merged.\n\n## Editing pages\n\n1. Navigate to the page you’d like to edit. \n2. At the bottom of the page, click the “**Edit this page**” button that has a pencil icon.\n3. If you haven’t already, log in to our CFPB GitHub repo.\n   The left side of your screen will show the CMS fields, the right side shows a preview of the page. You can edit the fields on the left as needed. The rich text field will let you easily style the text, but you can use additional markdown as needed to create the page content you want.\n4. Click “Save” at the top of the screen to save your work. Netlify will create a pull request in our public GitHub repo: <https://github.com/cfpb/design-system/pulls>. \n5. Your work will not be visible until your pull request has been approved and merged.\n\n## Sizing images\n\n## Updating navigation","objects":{"entry":{"path":"docs/getting-started/1-how-to-use-the-design-system.md","sha":"cf8a968f2b6a903929d3d2c55a77c4f5b75e3d31"},"files":[]},"timeStamp":"2019-09-09T19:05:20.023Z"}