{"type":"PR","pr":{"number":330,"head":"5c4925eafe485ac2168833cda2832daa0dfe4169"},"user":"Chris Contolini","status":"draft","branch":"cms/1-how-to-use-the-design-system","collection":"getting-started","commitMessage":"Update \"1-how-to-use-the-design-system\" page","title":"Updating this documentation","description":"## Creating new pages\n\n1. Through the Design System site you can quickly add a new page. Navigate to the section of the site where you’d like to add a new page. For example, if you want to add a new component page, make sure you’re in the “Components” section. \n2. Click the “+ Add new page” button at the bottom of the page.\n3. If you haven’t already, log in to our CFPB GitHub repo.\n4. Fill out the relevant fields of the CMS that appear on the left, a preview of your page will appear on the right. You can edit the fields on the left as needed. The rich text field will let you easily style the text, but you can use additional markdown as needed to create the page content you want.\n5. Click “Save” at the top of the screen to save your work. Netlify will create a pull request in our public GitHub repo: <https://github.com/cfpb/design-system/pulls>. \n6. Your work will not be visible until your pull request has been approved and merged.\n\n## Editing pages\n\n1. Navigate to the page you’d like to edit. \n2. At the bottom of the page, click the “**Edit this page**” button that has a pencil icon.\n3. If you haven’t already, log in to our CFPB GitHub repo.\n   The left side of your screen will show the CMS fields, the right side shows a preview of the page. You can edit the fields on the left as needed. The rich text field will let you easily style the text, but you can use additional markdown as needed to create the page content you want.\n4. Click “Save” at the top of the screen to save your work. Netlify will create a pull request in our public GitHub repo: <https://github.com/cfpb/design-system/pulls>. \n5. Your work will not be visible until your pull request has been approved and merged.\n\n## Sizing images\n\n## Updating navigation\n\n## Updating design tokens\n\nCFPB's design tokens are stored in a spreadsheet located in the repository's [`/docs/_data folder`](https://github.com/cfpb/design-system/tree/master/docs/_data). You can add new tokens and change existing ones by editing the file in your favorite spreadsheet software.\n\n![Screenshot of design tokens spreadsheet](/design-system/images/uploads/design-tokens-spreadsheet.png \"Screenshot of design tokens spreadsheet\")\n\nTo add a spec to a component variation's specs tables, add the applicable component variation to **column A**. Use the format `<component-name>_<variation-name>`. For example, to add the `Button background` spec in the above screenshot to the first variation on the [buttons component page](https://cfpb.github.io/design-system/components/buttons#variations), you would add `buttons_primary-button` to the row's first cell.\n\n**Column B** is the human-readable name of the specification and **column C** is the machine-readable name of the specification (we use [Less variables](https://github.com/cfpb/development/blob/master/standards/css.md#less)). The value of the specification can be added to **column D**. This will often be another Less variable.\n\n**Columns E - M** are the specifications' values. Complete only the applicable columns. For example, our headings (`h1`, `h2`, etc.) only have `Pixels` and `Points` defined because they're the only things needed to size a heading (pixels for websites and points for print documents). The `Second` and color columns are blank because time and colors don't concern headings.\n\n![Screenshot of headings in design tokens spreadsheet](/design-system/images/uploads/design-tokens-values.png \"Screenshot of headings in design tokens spreadsheet\")","objects":{"entry":{"path":"docs/getting-started/1-how-to-use-the-design-system.md","sha":"e9f30d847045c66f3bce89765d6267ef44be34c5"},"files":[{"path":"/docs/images/uploads/design-tokens-spreadsheet.png","sha":"349724f4b3599bd53dd91723c734d0a30627e4bb"},{"path":"/docs/images/uploads/design-tokens-values.png","sha":"d0be9bf5d9dd9722b4a6faa1998c552f71f39385"}]},"timeStamp":"2019-09-12T20:45:46.554Z"}