{"type":"PR","pr":{"number":206,"head":"9e2a81814fe9a6f6b31a2803c580885520cc7d7a"},"user":"Chris Contolini","status":"draft","branch":"cms/data-visualization","collection":"foundation","title":"Data Visualization","description":"### Whether you’re using Excel, Tableau, D3.js, or any other program, follow these guidelines to create effective and consistent data visualizations.\nData visualization can be an excellent way to increase understanding and make comparisons of data. Each graph should have a point that you want the user to walk away knowing.\nUsing visuals to convey meaning and to tell stories engages the user and creates a memorable experience. Part of this is choosing the correct visualization for the data. Make sure you understand the data and the relationship of your data before you choose visuals to help explain it to others.\nOccasionally, data visualization isn’t the best approach. A well crafted sentence or table may be a better solution to convey specific points or a precise numerical interpretation. Graphs are most useful when you want the user to walk away with a general sense of the data and to interpret patterns.\n##### KEY QUESTIONS\n* Is data visualization necessary to help achieve your objective? * Do you understand the data set? * What do you want people to walk away knowing?\n\nThis page is under active development. Information is being moved into it from this page:\n* http://cfpb.github.io/design-manual/data-visualization/data-visualization.html\n### Usage\n#### Use cases\nConsider your audience when you’re creating data visualization.\n##### KEY QUESTIONS\n* Who is your audience? * What is their familiarity with data visualization? * How much information do they need?\n##### If your user group is general (i.e. the American public)\nFor the general public, stick with basic and most common chart types that people can easily understand. Adding emphasis and labels will help highlight the point of the visual and tell the story of the information. Consider using multiple simple charts to step the user through the data, rather than one big complex visualization.\n##### If your user is refined to a specific audience\nWhen you’re creating visualizations for a specific target, take into consideration their familiarity with the data, visualization types, and the terminology used to label and describe data. More complex stories might necessitate more complex visuals, however, this does not mean it should lack emphasis.\n### Content guidelines\n#### Chart components\nUsing the appropriate font not only increases consistency with the core brand, but assures legibility and good visual hierarchy. Proper labeling and titles help users quickly understand the chart and increases comprehension as well as helping with accessibility.\n##### KEY QUESTIONS\n* Does your chart have a descriptive title and subtitle so someone who cannot see the chart could understand the general trends? * Have you included notes and a data source? * Is it clear when the data is from?\n##### Font\nAll data, labels and titles for data visualizations should be in a sans-serif font. The preferred choices for fonts are: Avenir Next over Arial, and Arial over another sans serif font.\nWhile serif fonts are generally easier to read for long blocks of text, data visualizations rarely include long blocks. The lack of serifs, especially on numbers, helps cut down on the amount of lines and visual clutter. This lack also increases the legibility of small text by eliminating thin serifs.\n##### Titles\nTitles should be as descriptive as possible to give users a sense of what the chart will be about. This not only provides users a framework of what they are looking at, but also helps with 508 accessibility and decreases the amount of text necessary in alt tags.\n![Labeled display of the titles on a chart.](/design-system/images/uploads/parts-of-a-chart_01.png)\n##### Labels and keys\nWherever possible, charts should not include a key, and data should be directly labeled. This reduces the cognitive burden for the user so they are not hunting for labels and trying to connect colors to the data.\n![Labeled display of the titles on a chart.](/design-system/images/uploads/parts-of-a-chart_012.png)\n![Labeled display of the titles on a chart.](/design-system/images/uploads/parts-of-a-chart_013.png)\n##### Reports\n###### Figure number\n* Uses the Figure number style (all caps)\nTitle\n* Gives an overview of what the graph is about * Uses the h3 heading style * 2 lines of text maximum\nSubtitle\n* Explains the general trends of the graph and what that means, including why it is important * Uses the h4 heading style * 3 lines of text maximum\nNotes\n* Describes any caveats or inconsistencies with the data such as explaining why numbers do not add up to 100% or the specific dates that the data is pulled from\nData source information\n* Provides a link to the URL of a spreadsheet or to the source of the data * Important to include for trustworthiness and validity * Allows people to dive deeper into the data and explore the nuances for themselves or to replicate the visualization\n##### Blog posts\n###### Title\n* Gives an overview of what the graph is about * Uses the h3 heading style * 2 lines of text maximum\n###### Subtitle\n* Explains the general trends of the graph and what that means, including why it is important * Uses the h4 heading style * 3 lines of text maximum\n###### Notes\n* Describes any caveats or inconsistencies with the data such as explaining why numbers do not add up to 100% or the specific dates that the data is pulled from\n###### Date\n* Include a date to at least the month and year of when the data was collected to provide context and accuracy over time.\n###### Data source information\n* Provides a link to the URL of a spreadsheet or to the source of the data * Important to include for trustworthiness and validity * Allows people to dive deeper into the data and explore the nuances for themselves or to replicate the visualization\n##### Social media\n###### Title\n* Gives an overview of what the graph is about * Uses the h3 heading style * 2 lines of text maximum\n###### Subtitle\n* Explains the general trends of the graph and what that means, including why it is important * Uses the h4 heading style * 3 lines of text maximum\n###### Notes\n* Describes any caveats or inconsistencies with the data such as explaining why numbers do not add up to 100% or the specific dates that the data is pulled from\n###### Date\n* Include a date to at least the month and year of when the data was collected to provide context and accuracy over time.\n###### Data source information\n* Provides a link to the URL of a spreadsheet or to the source of the data * Important to include for trustworthiness and validity * Allows people to dive deeper into the data and explore the nuances for themselves or to replicate the visualization\n###### CFPB logo\n* Include the CFPB logo; helps with identification and determining origin if the graphic gets re-used\n#### Accuracy\nA chart is only as good as the validity of its data. It’s important to check both the data and chart several times with multiple people before publishing. One small error can invalidate the integrity of an entire visualization. Several errors in data accuracy can damage credibility.\n##### KEY QUESTIONS\n* Is this an accurate way to represent this data?\n  Did someone else look at the chart and data for feedback?\n* If there are percentages, do they add up to 100? Why not? * What is the source of the data?\n##### Notes section\nWhen using charts that show percentages, users expect things to add up to 100%. If they don’t it undermines the integrity of the visuals by leaving the user with missing pieces.\nTo remedy this effect add a note at the bottom to explain the missing data.\n> Example: Percentages may not sum to 100% due to rounding.\nUse notes to add in other caveats around the data like if it was taken from a specific time period.\n> Example: Percent change is based on a 3 month period (October-December) and compared to the previous year. > > Example: Company-level information should be considered in context of total complaints, company size and market share in a given geographic area.\n##### Sources section\nIncluding the source of the data in the visualization is a must. It adds credibility and transparency to the graph. The visualization could then be replicated using the mentioned sources which adds credibility.\nIf you’re unable to link to the source, link to a spreadsheet of the data used to create the visualization.\n#### Emphasis\nHighlighting parts of your chart will help users quickly understand the point of the graphic and accurately comprehend the information.\n##### KEY QUESTIONS\n* What is the point of the chart? * Can someone who hasn’t seen the chart before figure out the point from a quick look and the title?\n##### Visual hierarchy\nGood visual hierarchy allows the user to focus on the most important piece of content first and work their way into the graphic. The title and subtitle should be the first thing that the user reads when viewing the chart to give them context of what the chart is about. Therefore, they should be the biggest thing on the chart.\nUse the squint test (take a step back from your graph, squint your eyes, and say what you see first, second, third…) to get a sense of what your users will automatically identify first.\n##### Labels\nGoals, trends, and important outliers should be highlighted to help the user discern what is going on with the data. Labels will help the user understand the data and make sense of what it is showing.\n##### Projected values\nWhen dealing with projected or predicted data, the predicted data should be deemphasized. Use a color change to a lighter tint or dashed outline for bar charts, a dotted line for line charts, and a label explaining what part of the data is predicted or projected.\n![Line chart that has a projected values label, as well as changes in color and pattern to indicate the projected data.](/design-system/images/uploads/projected-values-1.png)\n![Bar chart that has a projected values label, as well as changes in color to indicate the projected data.](/design-system/images/uploads/projected-values-2.png)\n### Accessibility\nAllowing all users to be able to comprehend charts and graphics is a key part of being a government agency that serves the entire American public. This is an interpretation of what it means for a chart to be 508 compliant and accessible, starting with descriptive titles and not only relying on color to connect data to its meaning.\n##### KEY QUESTIONS\n* How would someone using a screen reader interact with this visualization? * How would someone with low vision interact with this visualization?\n#### Alt tags\nAlt tags are what a screen reader will say instead of the image. This is important for not only web materials, but charts that are in pdfs and charts that are placed as images into word documents.\nScreen readers read all of the text in an alt tag without allowing users to speed up, or skip. Make sure the information in the alt tag is descriptive but succinct.\nAlt tags should include:\n* One sentence of what the chart is, including the chart type for users with limited vision who can see part of it, but may not be able to have a full understanding of the graph.\n  > Example: Bar chart showing complaints by type for New York metro area, New York state and the United States.\n* A link to a CSV or other machine-readable data format with the data so people with impaired vision can tab through the data with a screen reader. The data should have descriptive column labels and provide a link.\n#### Color contrast and color blindness\nSee the color section guidelines.","objects":{"entry":{"path":"docs/foundation/data-visualization.md","sha":"cb1ed94a2b7d3aa8a47763a4ba95a8e76a50af87"},"files":[]},"timeStamp":"2019-08-09T20:27:36.078Z"}