{"type":"PR","pr":{"number":343,"head":"3b38a6b72a44e112d567c55913738354bdf49c07"},"user":"Ans","status":"draft","branch":"cms/megamenu","collection":"components","commitMessage":"Update \"megamenu\" page","title":"Megamenu","description":"## Summary of [consumerfinance.gov](https://www.consumerfinance.gov) megamenu design principles\n\n1. The megamenu works everywhere.\n2. It’s equitable for all.\n3. It’s standardized.\n4. It’s focused on navigation and content.\n5. It’s a good and ever-improving experience.\n\n## More detailed version of design principles\n\n1. Our megamenu is based on industry standards around web development and user expectations around interactions. The megamenu works:\n\n* across our supported browsers,\n* across different browser sizes (and not just device form factors),\n* across the spectrum of user ability levels or technology familiarity, and\n* in line with the standard interactions for different assistive techniques.\n\n2. Our megamenu is designed to be equitable and provides full navigational support to all users. This includes users with physical disabilities, hearing and visual impairments, mental disorders, cognitive disabilities, or seizure disorders. Our megamenu is accessible and usable by all who use assistive technologies regardless of what type of disability they might have or their percentage within our larger user base. We do not ignore the needs of the few to only focus on the many.\n3. Our megamenu fully aligns with the WCAG core accessibility principles known as POUR: every part of it is perceivable, operable, understandable, and robust for all users.\n4. Our megamenu is built mobile-first with semantic code to focus on the content and navigation elements within it. It’s designed to work with the interaction defaults of both JAWS and Apple VoiceOver. The visual design supports all of these factors and doesn’t supersede them.\n5. We maintain a good megamenu experience for our users and actively work to improve it. All the designers and developers in the department read, share, and know where to find basic information about the megamenu. We are aware of its guidelines, its complexities, and what traps to avoid falling into when modifying it. We monitor and publish our site analytics for the megamenu on a regular basis to make sure that we’re continually aware of how users are using it and able to make necessary adjustments over time as needed. We also usability test the megamenu with external users as a part of the monitoring process.\n\nThe [consumerfinance.gov](https://www.consumerfinance.gov) website megamenu is composed of five verticals: Consumer Tools, Practitioner Resources, Data & Research, Policy & Compliance, and About Us. **The visual layout, spacing, and some portion of the content guidelines will change in the near future, as we monitor analytics information.**","objects":{"entry":{"path":"docs/components/megamenu.md","sha":"a1e577928ae947eb82c2ca12a0306c05dd1173a0"},"files":[]},"timeStamp":"2019-09-17T14:36:37.483Z"}